Revit 2024 API
RebarRoundingManager.TotalLengthRoundingMethod Property
 Identifies the total length rounding method
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public RoundingMethod TotalLengthRoundingMethod { get; set; }
Visual Basic
Public Property TotalLengthRoundingMethod As RoundingMethod
	Get
	Set
Visual C++
public:
property RoundingMethod TotalLengthRoundingMethod {
	RoundingMethod get ();
	void set (RoundingMethod value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: IsActiveOnElement property is false.
See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace